{"title":"ipython-tutorial","cells":[{"type":"markdown","data":"---\nlayout: page\ntitle: IPython Tutorial\npermalink: /ipython-tutorial/\n---\n\n***(Note: some of the screenshots here may be out-of-date. However, this should still prove\nuseful as a quick intro, and for the general menu layout, etc.)***\n\nIn this class, we will use IPython notebooks (more recently known as \n[Jupyter notebooks](https://jupyter.org/)) for the programming assignments. \nAn IPython notebook lets you write and execute Python code in your web browser. \nIPython notebooks make it very easy to tinker with code and execute it in bits \nand pieces; for this reason IPython notebooks are widely used in scientific \ncomputing.\n\n*(Note: if your virtual environment installed correctly (as per the assignment handouts),\nthen you shouldn't have to install from the install instructions on the website. Just\nremember to run `source .env/bin/activate` in your assignment folder.)*\n\n<!---\nOnce you have it [installed](http://jupyter.org/install.html), start it with this command:\n--->\n\nOnce you have it installed, start it with this command:\n"},{"type":"code","language":"text","data":"jupyter notebook"},{"type":"markdown","data":"\nOnce your notebook server is running, point your web browser at http://localhost:8888 to\nstart using your notebooks. If everything worked correctly, you should\nsee a screen like this, showing all available IPython notebooks in the current\ndirectory:\n\n<div class='fig figcenter'>\n  <img src='/assets/ipython-tutorial/file-browser.png'>\n</div>\n\nIf you click through to a notebook file, you will see a screen like this:\n\n<div class='fig figcenter'>\n  <img src='/assets/ipython-tutorial/notebook-1.png'>\n</div>\n\nAn IPython notebook is made up of a number of **cells**. Each cell can contain\nPython code. You can execute a cell by clicking on it and pressing `Shift-Enter`.\nWhen you do so, the code in the cell will run, and the output of the cell\nwill be displayed beneath the cell. For example, after running the first cell\nthe notebook looks like this:\n\n<div class='fig figcenter'>\n  <img src='/assets/ipython-tutorial/notebook-2.png'>\n</div>\n\nGlobal variables are shared between cells. Executing the second cell thus gives\nthe following result:\n\n<div class='fig figcenter'>\n  <img src='/assets/ipython-tutorial/notebook-3.png'>\n</div>\n\nBy convention, IPython notebooks are expected to be run from top to bottom.\nFailing to execute some cells or executing cells out of order can result in\nerrors:\n\n<div class='fig figcenter'>\n  <img src='/assets/ipython-tutorial/notebook-error.png'>\n</div>\n\nAfter you have modified an IPython notebook for one of the assignments by\nmodifying or executing some of its cells, remember to **save your changes!**\n\n<div class='fig figcenter'>\n  <img src='/assets/ipython-tutorial/save-notebook.png'>\n</div>\n\nThis has only been a brief introduction to IPython notebooks, but it should\nbe enough to get you up and running on the assignments for this course.\n"}]}